[command]/home/runner/work/_temp/046c01f0-cfc9-4ccd-81ac-56b7f478e4fe/terraform-bin plan
[0m[1maws_vpc.dev_vpc: Refreshing state... [id=vpc-0e434fc937ec7c46c][0m
[0m[1maws_internet_gateway.gw: Refreshing state... [id=igw-0d13bdb32f42b8240][0m
[0m[1maws_subnet.dev_us_east_1a: Refreshing state... [id=subnet-031948f8e811d6a18][0m
[0m[1maws_instance.dev: Refreshing state... [id=i-02bd28e1ab25583e0][0m
[0m
[1m[36mNote:[0m[1m Objects have changed outside of Terraform[0m

[0mTerraform detected the following changes made outside of Terraform since the
last "terraform apply":

[1m  # aws_instance.dev[0m has been deleted[0m[0m
[0m  [31m-[0m[0m resource "aws_instance" "dev" {
      [31m-[0m [0m[1m[0mami[0m[0m                                  = "ami-05ad4ed7f9c48178b" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0marn[0m[0m                                  = "arn:aws:ec2:us-east-1:221354683935:instance/i-02bd28e1ab25583e0" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0massociate_public_ip_address[0m[0m          = true [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mavailability_zone[0m[0m                    = "us-east-1a" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mcpu_core_count[0m[0m                       = 1 [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mcpu_threads_per_core[0m[0m                 = 2 [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mdisable_api_termination[0m[0m              = false [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mebs_optimized[0m[0m                        = false [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mget_password_data[0m[0m                    = false [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mhibernation[0m[0m                          = false [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mid[0m[0m                                   = "i-02bd28e1ab25583e0" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0minstance_initiated_shutdown_behavior[0m[0m = "stop" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0minstance_state[0m[0m                       = "running" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0minstance_type[0m[0m                        = "t3.micro" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mipv6_address_count[0m[0m                   = 0 [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mipv6_addresses[0m[0m                       = [] [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mkey_name[0m[0m                             = "Kaveh" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mmonitoring[0m[0m                           = false [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mprimary_network_interface_id[0m[0m         = "eni-07cc94c32f85fbe06" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mprivate_dns[0m[0m                          = "ip-172-16-10-34.ec2.internal" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mprivate_ip[0m[0m                           = "172.16.10.34" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mpublic_ip[0m[0m                            = "34.205.127.225" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0msecondary_private_ips[0m[0m                = [] [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0msecurity_groups[0m[0m                      = [] [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0msource_dest_check[0m[0m                    = true [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0msubnet_id[0m[0m                            = "subnet-031948f8e811d6a18" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mtags[0m[0m                                 = {
          [31m-[0m [0m"Name" = "dev"
        } [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mtags_all[0m[0m                             = {
          [31m-[0m [0m"Name" = "dev"
        } [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mtenancy[0m[0m                              = "default" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mvpc_security_group_ids[0m[0m               = [
          [31m-[0m [0m"sg-007ae9d2199ea1f25",
          [31m-[0m [0m"sg-09bafcc41daecda49",
        ] [90m->[0m [0m[90mnull[0m[0m

      [31m-[0m [0mcapacity_reservation_specification {
          [31m-[0m [0m[1m[0mcapacity_reservation_preference[0m[0m = "open" [90m->[0m [0m[90mnull[0m[0m
        }

      [31m-[0m [0mcredit_specification {
          [31m-[0m [0m[1m[0mcpu_credits[0m[0m = "unlimited" [90m->[0m [0m[90mnull[0m[0m
        }

      [31m-[0m [0menclave_options {
          [31m-[0m [0m[1m[0menabled[0m[0m = false [90m->[0m [0m[90mnull[0m[0m
        }

      [31m-[0m [0mmetadata_options {
          [31m-[0m [0m[1m[0mhttp_endpoint[0m[0m               = "enabled" [90m->[0m [0m[90mnull[0m[0m
          [31m-[0m [0m[1m[0mhttp_put_response_hop_limit[0m[0m = 1 [90m->[0m [0m[90mnull[0m[0m
          [31m-[0m [0m[1m[0mhttp_tokens[0m[0m                 = "optional" [90m->[0m [0m[90mnull[0m[0m
        }

      [31m-[0m [0mroot_block_device {
          [31m-[0m [0m[1m[0mdelete_on_termination[0m[0m = true [90m->[0m [0m[90mnull[0m[0m
          [31m-[0m [0m[1m[0mdevice_name[0m[0m           = "/dev/xvda" [90m->[0m [0m[90mnull[0m[0m
          [31m-[0m [0m[1m[0mencrypted[0m[0m             = false [90m->[0m [0m[90mnull[0m[0m
          [31m-[0m [0m[1m[0miops[0m[0m                  = 100 [90m->[0m [0m[90mnull[0m[0m
          [31m-[0m [0m[1m[0mtags[0m[0m                  = {} [90m->[0m [0m[90mnull[0m[0m
          [31m-[0m [0m[1m[0mthroughput[0m[0m            = 0 [90m->[0m [0m[90mnull[0m[0m
          [31m-[0m [0m[1m[0mvolume_id[0m[0m             = "vol-0e769defe0b4771e8" [90m->[0m [0m[90mnull[0m[0m
          [31m-[0m [0m[1m[0mvolume_size[0m[0m           = 8 [90m->[0m [0m[90mnull[0m[0m
          [31m-[0m [0m[1m[0mvolume_type[0m[0m           = "gp2" [90m->[0m [0m[90mnull[0m[0m
        }
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.
[90m
─────────────────────────────────────────────────────────────────────────────[0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create
[0m
Terraform will perform the following actions:

[1m  # aws_instance.dev[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_instance" "dev" {
      [32m+[0m [0m[1m[0mami[0m[0m                                  = "ami-05ad4ed7f9c48178b"
      [32m+[0m [0m[1m[0marn[0m[0m                                  = (known after apply)
      [32m+[0m [0m[1m[0massociate_public_ip_address[0m[0m          = true
      [32m+[0m [0m[1m[0mavailability_zone[0m[0m                    = (known after apply)
      [32m+[0m [0m[1m[0mcpu_core_count[0m[0m                       = (known after apply)
      [32m+[0m [0m[1m[0mcpu_threads_per_core[0m[0m                 = (known after apply)
      [32m+[0m [0m[1m[0mdisable_api_termination[0m[0m              = (known after apply)
      [32m+[0m [0m[1m[0mebs_optimized[0m[0m                        = (known after apply)
      [32m+[0m [0m[1m[0mget_password_data[0m[0m                    = false
      [32m+[0m [0m[1m[0mhost_id[0m[0m                              = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m                                   = (known after apply)
      [32m+[0m [0m[1m[0minstance_initiated_shutdown_behavior[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0minstance_state[0m[0m                       = (known after apply)
      [32m+[0m [0m[1m[0minstance_type[0m[0m                        = "t2.micro"
      [32m+[0m [0m[1m[0mipv6_address_count[0m[0m                   = (known after apply)
      [32m+[0m [0m[1m[0mipv6_addresses[0m[0m                       = (known after apply)
      [32m+[0m [0m[1m[0mkey_name[0m[0m                             = "Kaveh"
      [32m+[0m [0m[1m[0mmonitoring[0m[0m                           = (known after apply)
      [32m+[0m [0m[1m[0moutpost_arn[0m[0m                          = (known after apply)
      [32m+[0m [0m[1m[0mpassword_data[0m[0m                        = (known after apply)
      [32m+[0m [0m[1m[0mplacement_group[0m[0m                      = (known after apply)
      [32m+[0m [0m[1m[0mprimary_network_interface_id[0m[0m         = (known after apply)
      [32m+[0m [0m[1m[0mprivate_dns[0m[0m                          = (known after apply)
      [32m+[0m [0m[1m[0mprivate_ip[0m[0m                           = (known after apply)
      [32m+[0m [0m[1m[0mpublic_dns[0m[0m                           = (known after apply)
      [32m+[0m [0m[1m[0mpublic_ip[0m[0m                            = (known after apply)
      [32m+[0m [0m[1m[0msecondary_private_ips[0m[0m                = (known after apply)
      [32m+[0m [0m[1m[0msecurity_groups[0m[0m                      = (known after apply)
      [32m+[0m [0m[1m[0msource_dest_check[0m[0m                    = true
      [32m+[0m [0m[1m[0msubnet_id[0m[0m                            = "subnet-031948f8e811d6a18"
      [32m+[0m [0m[1m[0mtags[0m[0m                                 = {
          [32m+[0m [0m"Name" = "dev"
        }
      [32m+[0m [0m[1m[0mtags_all[0m[0m                             = {
          [32m+[0m [0m"Name" = "dev"
        }
      [32m+[0m [0m[1m[0mtenancy[0m[0m                              = (known after apply)
      [32m+[0m [0m[1m[0muser_data[0m[0m                            = (known after apply)
      [32m+[0m [0m[1m[0muser_data_base64[0m[0m                     = (known after apply)
      [32m+[0m [0m[1m[0mvpc_security_group_ids[0m[0m               = [
          [32m+[0m [0m"sg-007ae9d2199ea1f25",
          [32m+[0m [0m"sg-09bafcc41daecda49",
        ]

      [32m+[0m [0mcapacity_reservation_specification {
          [32m+[0m [0m[1m[0mcapacity_reservation_preference[0m[0m = (known after apply)

          [32m+[0m [0mcapacity_reservation_target {
              [32m+[0m [0m[1m[0mcapacity_reservation_id[0m[0m = (known after apply)
            }
        }

      [32m+[0m [0mebs_block_device {
          [32m+[0m [0m[1m[0mdelete_on_termination[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mdevice_name[0m[0m           = (known after apply)
          [32m+[0m [0m[1m[0mencrypted[0m[0m             = (known after apply)
          [32m+[0m [0m[1m[0miops[0m[0m                  = (known after apply)
          [32m+[0m [0m[1m[0mkms_key_id[0m[0m            = (known after apply)
          [32m+[0m [0m[1m[0msnapshot_id[0m[0m           = (known after apply)
          [32m+[0m [0m[1m[0mtags[0m[0m                  = (known after apply)
          [32m+[0m [0m[1m[0mthroughput[0m[0m            = (known after apply)
          [32m+[0m [0m[1m[0mvolume_id[0m[0m             = (known after apply)
          [32m+[0m [0m[1m[0mvolume_size[0m[0m           = (known after apply)
          [32m+[0m [0m[1m[0mvolume_type[0m[0m           = (known after apply)
        }

      [32m+[0m [0menclave_options {
          [32m+[0m [0m[1m[0menabled[0m[0m = (known after apply)
        }

      [32m+[0m [0mephemeral_block_device {
          [32m+[0m [0m[1m[0mdevice_name[0m[0m  = (known after apply)
          [32m+[0m [0m[1m[0mno_device[0m[0m    = (known after apply)
          [32m+[0m [0m[1m[0mvirtual_name[0m[0m = (known after apply)
        }

      [32m+[0m [0mmetadata_options {
          [32m+[0m [0m[1m[0mhttp_endpoint[0m[0m               = (known after apply)
          [32m+[0m [0m[1m[0mhttp_put_response_hop_limit[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mhttp_tokens[0m[0m                 = (known after apply)
        }

      [32m+[0m [0mnetwork_interface {
          [32m+[0m [0m[1m[0mdelete_on_termination[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mdevice_index[0m[0m          = (known after apply)
          [32m+[0m [0m[1m[0mnetwork_interface_id[0m[0m  = (known after apply)
        }

      [32m+[0m [0mroot_block_device {
          [32m+[0m [0m[1m[0mdelete_on_termination[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mdevice_name[0m[0m           = (known after apply)
          [32m+[0m [0m[1m[0mencrypted[0m[0m             = (known after apply)
          [32m+[0m [0m[1m[0miops[0m[0m                  = (known after apply)
          [32m+[0m [0m[1m[0mkms_key_id[0m[0m            = (known after apply)
          [32m+[0m [0m[1m[0mtags[0m[0m                  = (known after apply)
          [32m+[0m [0m[1m[0mthroughput[0m[0m            = (known after apply)
          [32m+[0m [0m[1m[0mvolume_id[0m[0m             = (known after apply)
          [32m+[0m [0m[1m[0mvolume_size[0m[0m           = (known after apply)
          [32m+[0m [0m[1m[0mvolume_type[0m[0m           = (known after apply)
        }
    }

[0m[1mPlan:[0m 1 to add, 0 to change, 0 to destroy.
[0m[0m
[1mChanges to Outputs:[0m[0m
  [33m~[0m [0m[1m[0mdev_ip[0m[0m = "34.205.127.225" [33m->[0m [0m(known after apply)
[90m
─────────────────────────────────────────────────────────────────────────────[0m

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
::debug::Terraform exited with code 0.
::debug::stdout: [0m[1maws_vpc.dev_vpc: Refreshing state... [id=vpc-0e434fc937ec7c46c][0m%0A[0m[1maws_internet_gateway.gw: Refreshing state... [id=igw-0d13bdb32f42b8240][0m%0A[0m[1maws_subnet.dev_us_east_1a: Refreshing state... [id=subnet-031948f8e811d6a18][0m%0A[0m[1maws_instance.dev: Refreshing state... [id=i-02bd28e1ab25583e0][0m%0A[0m%0A[1m[36mNote:[0m[1m Objects have changed outside of Terraform[0m%0A%0A[0mTerraform detected the following changes made outside of Terraform since the%0Alast "terraform apply":%0A%0A[1m  # aws_instance.dev[0m has been deleted[0m[0m%0A[0m  [31m-[0m[0m resource "aws_instance" "dev" {%0A      [31m-[0m [0m[1m[0mami[0m[0m                                  = "ami-05ad4ed7f9c48178b" [90m->[0m [0m[90mnull[0m[0m%0A      [31m-[0m [0m[1m[0marn[0m[0m                                  = "arn:aws:ec2:us-east-1:221354683935:instance/i-02bd28e1ab25583e0" [90m->[0m [0m[90mnull[0m[0m%0A      [31m-[0m [0m[1m[0massociate_public_ip_address[0m[0m          = true [90m->[0m [0m[90mnull[0m[0m%0A      [31m-[0m [0m[1m[0mavailability_zone[0m[0m                    = "us-east-1a" [90m->[0m [0m[90mnull[0m[0m%0A      [31m-[0m [0m[1m[0mcpu_core_count[0m[0m                       = 1 [90m->[0m [0m[90mnull[0m[0m%0A      [31m-[0m [0m[1m[0mcpu_threads_per_core[0m[0m                 = 2 [90m->[0m [0m[90mnull[0m[0m%0A      [31m-[0m [0m[1m[0mdisable_api_termination[0m[0m              = false [90m->[0m [0m[90mnull[0m[0m%0A      [31m-[0m [0m[1m[0mebs_optimized[0m[0m                        = false [90m->[0m [0m[90mnull[0m[0m%0A      [31m-[0m [0m[1m[0mget_password_data[0m[0m                    = false [90m->[0m [0m[90mnull[0m[0m%0A      [31m-[0m [0m[1m[0mhibernation[0m[0m                          = false [90m->[0m [0m[90mnull[0m[0m%0A      [31m-[0m [0m[1m[0mid[0m[0m                                   = "i-02bd28e1ab25583e0" [90m->[0m [0m[90mnull[0m[0m%0A      [31m-[0m [0m[1m[0minstance_initiated_shutdown_behavior[0m[0m = "stop" [90m->[0m [0m[90mnull[0m[0m%0A      [31m-[0m [0m[1m[0minstance_state[0m[0m                       = "running" [90m->[0m [0m[90mnull[0m[0m%0A      [31m-[0m [0m[1m[0minstance_type[0m[0m                        = "t3.micro" [90m->[0m [0m[90mnull[0m[0m%0A      [31m-[0m [0m[1m[0mipv6_address_count[0m[0m                   = 0 [90m->[0m [0m[90mnull[0m[0m%0A      [31m-[0m [0m[1m[0mipv6_addresses[0m[0m                       = [] [90m->[0m [0m[90mnull[0m[0m%0A      [31m-[0m [0m[1m[0mkey_name[0m[0m                             = "Kaveh" [90m->[0m [0m[90mnull[0m[0m%0A      [31m-[0m [0m[1m[0mmonitoring[0m[0m                           = false [90m->[0m [0m[90mnull[0m[0m%0A      [31m-[0m [0m[1m[0mprimary_network_interface_id[0m[0m         = "eni-07cc94c32f85fbe06" [90m->[0m [0m[90mnull[0m[0m%0A      [31m-[0m [0m[1m[0mprivate_dns[0m[0m                          = "ip-172-16-10-34.ec2.internal" [90m->[0m [0m[90mnull[0m[0m%0A      [31m-[0m [0m[1m[0mprivate_ip[0m[0m                           = "172.16.10.34" [90m->[0m [0m[90mnull[0m[0m%0A      [31m-[0m [0m[1m[0mpublic_ip[0m[0m                            = "34.205.127.225" [90m->[0m [0m[90mnull[0m[0m%0A      [31m-[0m [0m[1m[0msecondary_private_ips[0m[0m                = [] [90m->[0m [0m[90mnull[0m[0m%0A      [31m-[0m [0m[1m[0msecurity_groups[0m[0m                      = [] [90m->[0m [0m[90mnull[0m[0m%0A      [31m-[0m [0m[1m[0msource_dest_check[0m[0m                    = true [90m->[0m [0m[90mnull[0m[0m%0A      [31m-[0m [0m[1m[0msubnet_id[0m[0m                            = "subnet-031948f8e811d6a18" [90m->[0m [0m[90mnull[0m[0m%0A      [31m-[0m [0m[1m[0mtags[0m[0m                                 = {%0A          [31m-[0m [0m"Name" = "dev"%0A        } [90m->[0m [0m[90mnull[0m[0m%0A      [31m-[0m [0m[1m[0mtags_all[0m[0m                             = {%0A          [31m-[0m [0m"Name" = "dev"%0A        } [90m->[0m [0m[90mnull[0m[0m%0A      [31m-[0m [0m[1m[0mtenancy[0m[0m                              = "default" [90m->[0m [0m[90mnull[0m[0m%0A      [31m-[0m [0m[1m[0mvpc_security_group_ids[0m[0m               = [%0A          [31m-[0m [0m"sg-007ae9d2199ea1f25",%0A          [31m-[0m [0m"sg-09bafcc41daecda49",%0A        ] [90m->[0m [0m[90mnull[0m[0m%0A%0A      [31m-[0m [0mcapacity_reservation_specification {%0A          [31m-[0m [0m[1m[0mcapacity_reservation_preference[0m[0m = "open" [90m->[0m [0m[90mnull[0m[0m%0A        }%0A%0A      [31m-[0m [0mcredit_specification {%0A          [31m-[0m [0m[1m[0mcpu_credits[0m[0m = "unlimited" [90m->[0m [0m[90mnull[0m[0m%0A        }%0A%0A      [31m-[0m [0menclave_options {%0A          [31m-[0m [0m[1m[0menabled[0m[0m = false [90m->[0m [0m[90mnull[0m[0m%0A        }%0A%0A      [31m-[0m [0mmetadata_options {%0A          [31m-[0m [0m[1m[0mhttp_endpoint[0m[0m               = "enabled" [90m->[0m [0m[90mnull[0m[0m%0A          [31m-[0m [0m[1m[0mhttp_put_response_hop_limit[0m[0m = 1 [90m->[0m [0m[90mnull[0m[0m%0A          [31m-[0m [0m[1m[0mhttp_tokens[0m[0m                 = "optional" [90m->[0m [0m[90mnull[0m[0m%0A        }%0A%0A      [31m-[0m [0mroot_block_device {%0A          [31m-[0m [0m[1m[0mdelete_on_termination[0m[0m = true [90m->[0m [0m[90mnull[0m[0m%0A          [31m-[0m [0m[1m[0mdevice_name[0m[0m           = "/dev/xvda" [90m->[0m [0m[90mnull[0m[0m%0A          [31m-[0m [0m[1m[0mencrypted[0m[0m             = false [90m->[0m [0m[90mnull[0m[0m%0A          [31m-[0m [0m[1m[0miops[0m[0m                  = 100 [90m->[0m [0m[90mnull[0m[0m%0A          [31m-[0m [0m[1m[0mtags[0m[0m                  = {} [90m->[0m [0m[90mnull[0m[0m%0A          [31m-[0m [0m[1m[0mthroughput[0m[0m            = 0 [90m->[0m [0m[90mnull[0m[0m%0A          [31m-[0m [0m[1m[0mvolume_id[0m[0m             = "vol-0e769defe0b4771e8" [90m->[0m [0m[90mnull[0m[0m%0A          [31m-[0m [0m[1m[0mvolume_size[0m[0m           = 8 [90m->[0m [0m[90mnull[0m[0m%0A          [31m-[0m [0m[1m[0mvolume_type[0m[0m           = "gp2" [90m->[0m [0m[90mnull[0m[0m%0A        }%0A    }%0A%0AUnless you have made equivalent changes to your configuration, or ignored the%0Arelevant attributes using ignore_changes, the following plan may include%0Aactions to undo or respond to these changes.%0A[90m%0A─────────────────────────────────────────────────────────────────────────────[0m%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  [32m+[0m create%0A[0m%0ATerraform will perform the following actions:%0A%0A[1m  # aws_instance.dev[0m will be created[0m[0m%0A[0m  [32m+[0m[0m resource "aws_instance" "dev" {%0A      [32m+[0m [0m[1m[0mami[0m[0m                                  = "ami-05ad4ed7f9c48178b"%0A      [32m+[0m [0m[1m[0marn[0m[0m                                  = (known after apply)%0A      [32m+[0m [0m[1m[0massociate_public_ip_address[0m[0m          = true%0A      [32m+[0m [0m[1m[0mavailability_zone[0m[0m                    = (known after apply)%0A      [32m+[0m [0m[1m[0mcpu_core_count[0m[0m                       = (known after apply)%0A      [32m+[0m [0m[1m[0mcpu_threads_per_core[0m[0m                 = (known after apply)%0A      [32m+[0m [0m[1m[0mdisable_api_termination[0m[0m              = (known after apply)%0A      [32m+[0m [0m[1m[0mebs_optimized[0m[0m                        = (known after apply)%0A      [32m+[0m [0m[1m[0mget_password_data[0m[0m                    = false%0A      [32m+[0m [0m[1m[0mhost_id[0m[0m                              = (known after apply)%0A      [32m+[0m [0m[1m[0mid[0m[0m                                   = (known after apply)%0A      [32m+[0m [0m[1m[0minstance_initiated_shutdown_behavior[0m[0m = (known after apply)%0A      [32m+[0m [0m[1m[0minstance_state[0m[0m                       = (known after apply)%0A      [32m+[0m [0m[1m[0minstance_type[0m[0m                        = "t2.micro"%0A      [32m+[0m [0m[1m[0mipv6_address_count[0m[0m                   = (known after apply)%0A      [32m+[0m [0m[1m[0mipv6_addresses[0m[0m                       = (known after apply)%0A      [32m+[0m [0m[1m[0mkey_name[0m[0m                             = "Kaveh"%0A      [32m+[0m [0m[1m[0mmonitoring[0m[0m                           = (known after apply)%0A      [32m+[0m [0m[1m[0moutpost_arn[0m[0m                          = (known after apply)%0A      [32m+[0m [0m[1m[0mpassword_data[0m[0m                        = (known after apply)%0A      [32m+[0m [0m[1m[0mplacement_group[0m[0m                      = (known after apply)%0A      [32m+[0m [0m[1m[0mprimary_network_interface_id[0m[0m         = (known after apply)%0A      [32m+[0m [0m[1m[0mprivate_dns[0m[0m                          = (known after apply)%0A      [32m+[0m [0m[1m[0mprivate_ip[0m[0m                           = (known after apply)%0A      [32m+[0m [0m[1m[0mpublic_dns[0m[0m                           = (known after apply)%0A      [32m+[0m [0m[1m[0mpublic_ip[0m[0m                            = (known after apply)%0A      [32m+[0m [0m[1m[0msecondary_private_ips[0m[0m                = (known after apply)%0A      [32m+[0m [0m[1m[0msecurity_groups[0m[0m                      = (known after apply)%0A      [32m+[0m [0m[1m[0msource_dest_check[0m[0m                    = true%0A      [32m+[0m [0m[1m[0msubnet_id[0m[0m                            = "subnet-031948f8e811d6a18"%0A      [32m+[0m [0m[1m[0mtags[0m[0m                                 = {%0A          [32m+[0m [0m"Name" = "dev"%0A        }%0A      [32m+[0m [0m[1m[0mtags_all[0m[0m                             = {%0A          [32m+[0m [0m"Name" = "dev"%0A        }%0A      [32m+[0m [0m[1m[0mtenancy[0m[0m                              = (known after apply)%0A      [32m+[0m [0m[1m[0muser_data[0m[0m                            = (known after apply)%0A      [32m+[0m [0m[1m[0muser_data_base64[0m[0m                     = (known after apply)%0A      [32m+[0m [0m[1m[0mvpc_security_group_ids[0m[0m               = [%0A          [32m+[0m [0m"sg-007ae9d2199ea1f25",%0A          [32m+[0m [0m"sg-09bafcc41daecda49",%0A        ]%0A%0A      [32m+[0m [0mcapacity_reservation_specification {%0A          [32m+[0m [0m[1m[0mcapacity_reservation_preference[0m[0m = (known after apply)%0A%0A          [32m+[0m [0mcapacity_reservation_target {%0A              [32m+[0m [0m[1m[0mcapacity_reservation_id[0m[0m = (known after apply)%0A            }%0A        }%0A%0A      [32m+[0m [0mebs_block_device {%0A          [32m+[0m [0m[1m[0mdelete_on_termination[0m[0m = (known after apply)%0A          [32m+[0m [0m[1m[0mdevice_name[0m[0m           = (known after apply)%0A          [32m+[0m [0m[1m[0mencrypted[0m[0m             = (known after apply)%0A          [32m+[0m [0m[1m[0miops[0m[0m                  = (known after apply)%0A          [32m+[0m [0m[1m[0mkms_key_id[0m[0m            = (known after apply)%0A          [32m+[0m [0m[1m[0msnapshot_id[0m[0m           = (known after apply)%0A          [32m+[0m [0m[1m[0mtags[0m[0m                  = (known after apply)%0A          [32m+[0m [0m[1m[0mthroughput[0m[0m            = (known after apply)%0A          [32m+[0m [0m[1m[0mvolume_id[0m[0m             = (known after apply)%0A          [32m+[0m [0m[1m[0mvolume_size[0m[0m           = (known after apply)%0A          [32m+[0m [0m[1m[0mvolume_type[0m[0m           = (known after apply)%0A        }%0A%0A      [32m+[0m [0menclave_options {%0A          [32m+[0m [0m[1m[0menabled[0m[0m = (known after apply)%0A        }%0A%0A      [32m+[0m [0mephemeral_block_device {%0A          [32m+[0m [0m[1m[0mdevice_name[0m[0m  = (known after apply)%0A          [32m+[0m [0m[1m[0mno_device[0m[0m    = (known after apply)%0A          [32m+[0m [0m[1m[0mvirtual_name[0m[0m = (known after apply)%0A        }%0A%0A      [32m+[0m [0mmetadata_options {%0A          [32m+[0m [0m[1m[0mhttp_endpoint[0m[0m               = (known after apply)%0A          [32m+[0m [0m[1m[0mhttp_put_response_hop_limit[0m[0m = (known after apply)%0A          [32m+[0m [0m[1m[0mhttp_tokens[0m[0m                 = (known after apply)%0A        }%0A%0A      [32m+[0m [0mnetwork_interface {%0A          [32m+[0m [0m[1m[0mdelete_on_termination[0m[0m = (known after apply)%0A          [32m+[0m [0m[1m[0mdevice_index[0m[0m          = (known after apply)%0A          [32m+[0m [0m[1m[0mnetwork_interface_id[0m[0m  = (known after apply)%0A        }%0A%0A      [32m+[0m [0mroot_block_device {%0A          [32m+[0m [0m[1m[0mdelete_on_termination[0m[0m = (known after apply)%0A          [32m+[0m [0m[1m[0mdevice_name[0m[0m           = (known after apply)%0A          [32m+[0m [0m[1m[0mencrypted[0m[0m             = (known after apply)%0A          [32m+[0m [0m[1m[0miops[0m[0m                  = (known after apply)%0A          [32m+[0m [0m[1m[0mkms_key_id[0m[0m            = (known after apply)%0A          [32m+[0m [0m[1m[0mtags[0m[0m                  = (known after apply)%0A          [32m+[0m [0m[1m[0mthroughput[0m[0m            = (known after apply)%0A          [32m+[0m [0m[1m[0mvolume_id[0m[0m             = (known after apply)%0A          [32m+[0m [0m[1m[0mvolume_size[0m[0m           = (known after apply)%0A          [32m+[0m [0m[1m[0mvolume_type[0m[0m           = (known after apply)%0A        }%0A    }%0A%0A[0m[1mPlan:[0m 1 to add, 0 to change, 0 to destroy.%0A[0m[0m%0A[1mChanges to Outputs:[0m[0m%0A  [33m~[0m [0m[1m[0mdev_ip[0m[0m = "34.205.127.225" [33m->[0m [0m(known after apply)%0A[90m%0A─────────────────────────────────────────────────────────────────────────────[0m%0A%0ANote: You didn't use the -out option to save this plan, so Terraform can't%0Aguarantee to take exactly these actions if you run "terraform apply" now.%0A
::debug::stderr: 
::debug::exitcode: 0
::set-output name=stdout::[0m[1maws_vpc.dev_vpc: Refreshing state... [id=vpc-0e434fc937ec7c46c][0m%0A[0m[1maws_internet_gateway.gw: Refreshing state... [id=igw-0d13bdb32f42b8240][0m%0A[0m[1maws_subnet.dev_us_east_1a: Refreshing state... [id=subnet-031948f8e811d6a18][0m%0A[0m[1maws_instance.dev: Refreshing state... [id=i-02bd28e1ab25583e0][0m%0A[0m%0A[1m[36mNote:[0m[1m Objects have changed outside of Terraform[0m%0A%0A[0mTerraform detected the following changes made outside of Terraform since the%0Alast "terraform apply":%0A%0A[1m  # aws_instance.dev[0m has been deleted[0m[0m%0A[0m  [31m-[0m[0m resource "aws_instance" "dev" {%0A      [31m-[0m [0m[1m[0mami[0m[0m                                  = "ami-05ad4ed7f9c48178b" [90m->[0m [0m[90mnull[0m[0m%0A      [31m-[0m [0m[1m[0marn[0m[0m                                  = "arn:aws:ec2:us-east-1:221354683935:instance/i-02bd28e1ab25583e0" [90m->[0m [0m[90mnull[0m[0m%0A      [31m-[0m [0m[1m[0massociate_public_ip_address[0m[0m          = true [90m->[0m [0m[90mnull[0m[0m%0A      [31m-[0m [0m[1m[0mavailability_zone[0m[0m                    = "us-east-1a" [90m->[0m [0m[90mnull[0m[0m%0A      [31m-[0m [0m[1m[0mcpu_core_count[0m[0m                       = 1 [90m->[0m [0m[90mnull[0m[0m%0A      [31m-[0m [0m[1m[0mcpu_threads_per_core[0m[0m                 = 2 [90m->[0m [0m[90mnull[0m[0m%0A      [31m-[0m [0m[1m[0mdisable_api_termination[0m[0m              = false [90m->[0m [0m[90mnull[0m[0m%0A      [31m-[0m [0m[1m[0mebs_optimized[0m[0m                        = false [90m->[0m [0m[90mnull[0m[0m%0A      [31m-[0m [0m[1m[0mget_password_data[0m[0m                    = false [90m->[0m [0m[90mnull[0m[0m%0A      [31m-[0m [0m[1m[0mhibernation[0m[0m                          = false [90m->[0m [0m[90mnull[0m[0m%0A      [31m-[0m [0m[1m[0mid[0m[0m                                   = "i-02bd28e1ab25583e0" [90m->[0m [0m[90mnull[0m[0m%0A      [31m-[0m [0m[1m[0minstance_initiated_shutdown_behavior[0m[0m = "stop" [90m->[0m [0m[90mnull[0m[0m%0A      [31m-[0m [0m[1m[0minstance_state[0m[0m                       = "running" [90m->[0m [0m[90mnull[0m[0m%0A      [31m-[0m [0m[1m[0minstance_type[0m[0m                        = "t3.micro" [90m->[0m [0m[90mnull[0m[0m%0A      [31m-[0m [0m[1m[0mipv6_address_count[0m[0m                   = 0 [90m->[0m [0m[90mnull[0m[0m%0A      [31m-[0m [0m[1m[0mipv6_addresses[0m[0m                       = [] [90m->[0m [0m[90mnull[0m[0m%0A      [31m-[0m [0m[1m[0mkey_name[0m[0m                             = "Kaveh" [90m->[0m [0m[90mnull[0m[0m%0A      [31m-[0m [0m[1m[0mmonitoring[0m[0m                           = false [90m->[0m [0m[90mnull[0m[0m%0A      [31m-[0m [0m[1m[0mprimary_network_interface_id[0m[0m         = "eni-07cc94c32f85fbe06" [90m->[0m [0m[90mnull[0m[0m%0A      [31m-[0m [0m[1m[0mprivate_dns[0m[0m                          = "ip-172-16-10-34.ec2.internal" [90m->[0m [0m[90mnull[0m[0m%0A      [31m-[0m [0m[1m[0mprivate_ip[0m[0m                           = "172.16.10.34" [90m->[0m [0m[90mnull[0m[0m%0A      [31m-[0m [0m[1m[0mpublic_ip[0m[0m                            = "34.205.127.225" [90m->[0m [0m[90mnull[0m[0m%0A      [31m-[0m [0m[1m[0msecondary_private_ips[0m[0m                = [] [90m->[0m [0m[90mnull[0m[0m%0A      [31m-[0m [0m[1m[0msecurity_groups[0m[0m                      = [] [90m->[0m [0m[90mnull[0m[0m%0A      [31m-[0m [0m[1m[0msource_dest_check[0m[0m                    = true [90m->[0m [0m[90mnull[0m[0m%0A      [31m-[0m [0m[1m[0msubnet_id[0m[0m                            = "subnet-031948f8e811d6a18" [90m->[0m [0m[90mnull[0m[0m%0A      [31m-[0m [0m[1m[0mtags[0m[0m                                 = {%0A          [31m-[0m [0m"Name" = "dev"%0A        } [90m->[0m [0m[90mnull[0m[0m%0A      [31m-[0m [0m[1m[0mtags_all[0m[0m                             = {%0A          [31m-[0m [0m"Name" = "dev"%0A        } [90m->[0m [0m[90mnull[0m[0m%0A      [31m-[0m [0m[1m[0mtenancy[0m[0m                              = "default" [90m->[0m [0m[90mnull[0m[0m%0A      [31m-[0m [0m[1m[0mvpc_security_group_ids[0m[0m               = [%0A          [31m-[0m [0m"sg-007ae9d2199ea1f25",%0A          [31m-[0m [0m"sg-09bafcc41daecda49",%0A        ] [90m->[0m [0m[90mnull[0m[0m%0A%0A      [31m-[0m [0mcapacity_reservation_specification {%0A          [31m-[0m [0m[1m[0mcapacity_reservation_preference[0m[0m = "open" [90m->[0m [0m[90mnull[0m[0m%0A        }%0A%0A      [31m-[0m [0mcredit_specification {%0A          [31m-[0m [0m[1m[0mcpu_credits[0m[0m = "unlimited" [90m->[0m [0m[90mnull[0m[0m%0A        }%0A%0A      [31m-[0m [0menclave_options {%0A          [31m-[0m [0m[1m[0menabled[0m[0m = false [90m->[0m [0m[90mnull[0m[0m%0A        }%0A%0A      [31m-[0m [0mmetadata_options {%0A          [31m-[0m [0m[1m[0mhttp_endpoint[0m[0m               = "enabled" [90m->[0m [0m[90mnull[0m[0m%0A          [31m-[0m [0m[1m[0mhttp_put_response_hop_limit[0m[0m = 1 [90m->[0m [0m[90mnull[0m[0m%0A          [31m-[0m [0m[1m[0mhttp_tokens[0m[0m                 = "optional" [90m->[0m [0m[90mnull[0m[0m%0A        }%0A%0A      [31m-[0m [0mroot_block_device {%0A          [31m-[0m [0m[1m[0mdelete_on_termination[0m[0m = true [90m->[0m [0m[90mnull[0m[0m%0A          [31m-[0m [0m[1m[0mdevice_name[0m[0m           = "/dev/xvda" [90m->[0m [0m[90mnull[0m[0m%0A          [31m-[0m [0m[1m[0mencrypted[0m[0m             = false [90m->[0m [0m[90mnull[0m[0m%0A          [31m-[0m [0m[1m[0miops[0m[0m                  = 100 [90m->[0m [0m[90mnull[0m[0m%0A          [31m-[0m [0m[1m[0mtags[0m[0m                  = {} [90m->[0m [0m[90mnull[0m[0m%0A          [31m-[0m [0m[1m[0mthroughput[0m[0m            = 0 [90m->[0m [0m[90mnull[0m[0m%0A          [31m-[0m [0m[1m[0mvolume_id[0m[0m             = "vol-0e769defe0b4771e8" [90m->[0m [0m[90mnull[0m[0m%0A          [31m-[0m [0m[1m[0mvolume_size[0m[0m           = 8 [90m->[0m [0m[90mnull[0m[0m%0A          [31m-[0m [0m[1m[0mvolume_type[0m[0m           = "gp2" [90m->[0m [0m[90mnull[0m[0m%0A        }%0A    }%0A%0AUnless you have made equivalent changes to your configuration, or ignored the%0Arelevant attributes using ignore_changes, the following plan may include%0Aactions to undo or respond to these changes.%0A[90m%0A─────────────────────────────────────────────────────────────────────────────[0m%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  [32m+[0m create%0A[0m%0ATerraform will perform the following actions:%0A%0A[1m  # aws_instance.dev[0m will be created[0m[0m%0A[0m  [32m+[0m[0m resource "aws_instance" "dev" {%0A      [32m+[0m [0m[1m[0mami[0m[0m                                  = "ami-05ad4ed7f9c48178b"%0A      [32m+[0m [0m[1m[0marn[0m[0m                                  = (known after apply)%0A      [32m+[0m [0m[1m[0massociate_public_ip_address[0m[0m          = true%0A      [32m+[0m [0m[1m[0mavailability_zone[0m[0m                    = (known after apply)%0A      [32m+[0m [0m[1m[0mcpu_core_count[0m[0m                       = (known after apply)%0A      [32m+[0m [0m[1m[0mcpu_threads_per_core[0m[0m                 = (known after apply)%0A      [32m+[0m [0m[1m[0mdisable_api_termination[0m[0m              = (known after apply)%0A      [32m+[0m [0m[1m[0mebs_optimized[0m[0m                        = (known after apply)%0A      [32m+[0m [0m[1m[0mget_password_data[0m[0m                    = false%0A      [32m+[0m [0m[1m[0mhost_id[0m[0m                              = (known after apply)%0A      [32m+[0m [0m[1m[0mid[0m[0m                                   = (known after apply)%0A      [32m+[0m [0m[1m[0minstance_initiated_shutdown_behavior[0m[0m = (known after apply)%0A      [32m+[0m [0m[1m[0minstance_state[0m[0m                       = (known after apply)%0A      [32m+[0m [0m[1m[0minstance_type[0m[0m                        = "t2.micro"%0A      [32m+[0m [0m[1m[0mipv6_address_count[0m[0m                   = (known after apply)%0A      [32m+[0m [0m[1m[0mipv6_addresses[0m[0m                       = (known after apply)%0A      [32m+[0m [0m[1m[0mkey_name[0m[0m                             = "Kaveh"%0A      [32m+[0m [0m[1m[0mmonitoring[0m[0m                           = (known after apply)%0A      [32m+[0m [0m[1m[0moutpost_arn[0m[0m                          = (known after apply)%0A      [32m+[0m [0m[1m[0mpassword_data[0m[0m                        = (known after apply)%0A      [32m+[0m [0m[1m[0mplacement_group[0m[0m                      = (known after apply)%0A      [32m+[0m [0m[1m[0mprimary_network_interface_id[0m[0m         = (known after apply)%0A      [32m+[0m [0m[1m[0mprivate_dns[0m[0m                          = (known after apply)%0A      [32m+[0m [0m[1m[0mprivate_ip[0m[0m                           = (known after apply)%0A      [32m+[0m [0m[1m[0mpublic_dns[0m[0m                           = (known after apply)%0A      [32m+[0m [0m[1m[0mpublic_ip[0m[0m                            = (known after apply)%0A      [32m+[0m [0m[1m[0msecondary_private_ips[0m[0m                = (known after apply)%0A      [32m+[0m [0m[1m[0msecurity_groups[0m[0m                      = (known after apply)%0A      [32m+[0m [0m[1m[0msource_dest_check[0m[0m                    = true%0A      [32m+[0m [0m[1m[0msubnet_id[0m[0m                            = "subnet-031948f8e811d6a18"%0A      [32m+[0m [0m[1m[0mtags[0m[0m                                 = {%0A          [32m+[0m [0m"Name" = "dev"%0A        }%0A      [32m+[0m [0m[1m[0mtags_all[0m[0m                             = {%0A          [32m+[0m [0m"Name" = "dev"%0A        }%0A      [32m+[0m [0m[1m[0mtenancy[0m[0m                              = (known after apply)%0A      [32m+[0m [0m[1m[0muser_data[0m[0m                            = (known after apply)%0A      [32m+[0m [0m[1m[0muser_data_base64[0m[0m                     = (known after apply)%0A      [32m+[0m [0m[1m[0mvpc_security_group_ids[0m[0m               = [%0A          [32m+[0m [0m"sg-007ae9d2199ea1f25",%0A          [32m+[0m [0m"sg-09bafcc41daecda49",%0A        ]%0A%0A      [32m+[0m [0mcapacity_reservation_specification {%0A          [32m+[0m [0m[1m[0mcapacity_reservation_preference[0m[0m = (known after apply)%0A%0A          [32m+[0m [0mcapacity_reservation_target {%0A              [32m+[0m [0m[1m[0mcapacity_reservation_id[0m[0m = (known after apply)%0A            }%0A        }%0A%0A      [32m+[0m [0mebs_block_device {%0A          [32m+[0m [0m[1m[0mdelete_on_termination[0m[0m = (known after apply)%0A          [32m+[0m [0m[1m[0mdevice_name[0m[0m           = (known after apply)%0A          [32m+[0m [0m[1m[0mencrypted[0m[0m             = (known after apply)%0A          [32m+[0m [0m[1m[0miops[0m[0m                  = (known after apply)%0A          [32m+[0m [0m[1m[0mkms_key_id[0m[0m            = (known after apply)%0A          [32m+[0m [0m[1m[0msnapshot_id[0m[0m           = (known after apply)%0A          [32m+[0m [0m[1m[0mtags[0m[0m                  = (known after apply)%0A          [32m+[0m [0m[1m[0mthroughput[0m[0m            = (known after apply)%0A          [32m+[0m [0m[1m[0mvolume_id[0m[0m             = (known after apply)%0A          [32m+[0m [0m[1m[0mvolume_size[0m[0m           = (known after apply)%0A          [32m+[0m [0m[1m[0mvolume_type[0m[0m           = (known after apply)%0A        }%0A%0A      [32m+[0m [0menclave_options {%0A          [32m+[0m [0m[1m[0menabled[0m[0m = (known after apply)%0A        }%0A%0A      [32m+[0m [0mephemeral_block_device {%0A          [32m+[0m [0m[1m[0mdevice_name[0m[0m  = (known after apply)%0A          [32m+[0m [0m[1m[0mno_device[0m[0m    = (known after apply)%0A          [32m+[0m [0m[1m[0mvirtual_name[0m[0m = (known after apply)%0A        }%0A%0A      [32m+[0m [0mmetadata_options {%0A          [32m+[0m [0m[1m[0mhttp_endpoint[0m[0m               = (known after apply)%0A          [32m+[0m [0m[1m[0mhttp_put_response_hop_limit[0m[0m = (known after apply)%0A          [32m+[0m [0m[1m[0mhttp_tokens[0m[0m                 = (known after apply)%0A        }%0A%0A      [32m+[0m [0mnetwork_interface {%0A          [32m+[0m [0m[1m[0mdelete_on_termination[0m[0m = (known after apply)%0A          [32m+[0m [0m[1m[0mdevice_index[0m[0m          = (known after apply)%0A          [32m+[0m [0m[1m[0mnetwork_interface_id[0m[0m  = (known after apply)%0A        }%0A%0A      [32m+[0m [0mroot_block_device {%0A          [32m+[0m [0m[1m[0mdelete_on_termination[0m[0m = (known after apply)%0A          [32m+[0m [0m[1m[0mdevice_name[0m[0m           = (known after apply)%0A          [32m+[0m [0m[1m[0mencrypted[0m[0m             = (known after apply)%0A          [32m+[0m [0m[1m[0miops[0m[0m                  = (known after apply)%0A          [32m+[0m [0m[1m[0mkms_key_id[0m[0m            = (known after apply)%0A          [32m+[0m [0m[1m[0mtags[0m[0m                  = (known after apply)%0A          [32m+[0m [0m[1m[0mthroughput[0m[0m            = (known after apply)%0A          [32m+[0m [0m[1m[0mvolume_id[0m[0m             = (known after apply)%0A          [32m+[0m [0m[1m[0mvolume_size[0m[0m           = (known after apply)%0A          [32m+[0m [0m[1m[0mvolume_type[0m[0m           = (known after apply)%0A        }%0A    }%0A%0A[0m[1mPlan:[0m 1 to add, 0 to change, 0 to destroy.%0A[0m[0m%0A[1mChanges to Outputs:[0m[0m%0A  [33m~[0m [0m[1m[0mdev_ip[0m[0m = "34.205.127.225" [33m->[0m [0m(known after apply)%0A[90m%0A─────────────────────────────────────────────────────────────────────────────[0m%0A%0ANote: You didn't use the -out option to save this plan, so Terraform can't%0Aguarantee to take exactly these actions if you run "terraform apply" now.%0A
::set-output name=stderr::
::set-output name=exitcode::0
